package com.ilanp13.shabbatalertdismisser

object OrefRegions {
    val all: List<String> = listOf(
        // Gush Dan
        "תל אביב",
        "רמת גן",
        "גבעתיים",
        "חולון",
        "בת ים",
        "ראשון לציון",
        "ריסוןצִיּוֹן",
        "הוד השרון",
        "קרית אונו",
        "פתח תקוה",
        "כפר סבא",
        "רעננה",
        "הרצליה",

        // Jerusalem
        "ירושלים",
        "מודיעין מכבים רְאוּם",

        // Haifa area
        "חיפה",
        "קרית מוצקין",
        "קרית ים",
        "קרית אתא",
        "נשר",

        // North
        "נצרת",
        "צפת",
        "קרית שמונה",
        "כנרת",
        "בית שאן",
        "טבריה",
        "מגדל",
        "מירון",
        "יקנעם עמק",
        "עפולה",
        "תבור",

        // South
        "באר שבע",
        "אשקלון",
        "אשדוד",
        "קציעות",
        "נתיבות",
        "אופקים",
        "שדרוט",
        "ניצנים",
        "קריית גת",
        "לקיה",
        "ערד",

        // West Bank periphery
        "אריאל",
        "ודי ומחנות",
        "קלנדיה",

        // Negev
        "אילת",
        "דימונה",
        "מצדא",
        "סדום",
        "אנתרוט",

        // Coastal
        "נתניה",
        "כפר יונה",

        // Central
        "רמלה",
        "לוד",
        "רחובות",
        "גן יבנה",
        "יבנה",
        "קרית מלאכי",
        "אשדוד",
        "תל שבע",

        // Shephelah
        "בית שמש",
        "רמות",

        // Dead Sea
        "אנגדי",

        // Golan
        "קצרין",
        "מעלות",

        // Additional regions
        "אביבים",
        "אופיר",
        "בנימינה",
        "ביריה",
        "דן",
        "דברת",
        "גדות",
        "גדור",
        "גילבוע",
        "גינוסר",
        "גישר",
        "גלעד",
        "גלקיה",
        "גניגר",
        "גרמה"
    )
}
